import os
from dotenv import load_dotenv
bot = '7971545933:AAHJpI7CzpfvlYVF5y9liUqx4RyjDMJbmPA'
load_dotenv()

class Config:
    # Ключи из переменных окружения
    BOT_TOKEN = os.getenv(bot)
    DEEPINFRA_API_KEY = os.getenv('DEEPINFRA_API_KEY')
    DEEPINFRA_API_URL = "https://api.deepinfra.com/v1/inference/mistralai/Mixtral-8x7B-Instruct-v0.1"

    # Запасные ответы если ИИ не работает
    FALLBACK_RESPONSES = {
        'workout_reaction': [
            "Отличная работа! Ты становишься сильнее с каждой тренировкой! 💪",
            "Прекрасно! Регулярность - ключ к успеху в фитнесе! 🔑",
            "Молодец! Помни: даже небольшие тренировки ведут к большим результатам! 🌟",
        ],
        'advice': [
            "Попробуй добавить разнообразия в свои тренировки! 🔄",
            "Не забывай про восстановление - это важно для прогресса! 🛌",
            "Слушай свое тело и корректируй нагрузку при необходимости! 👂",
        ]
    }